{"class_name": "Sequential", "config": [{"class_name": "Model", "config": {"output_layers": [["loss2/conv", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 1]}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [7, 7], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "conv1/7x7_s2", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [2, 2]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1/7x7_s2"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "pool1/3x3_s2", "strides": [2, 2]}, "inbound_nodes": [[["conv1/7x7_s2", 0, 0, {}]]], "name": "pool1/3x3_s2"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "conv2/3x3_reduce", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool1/3x3_s2", 0, 0, {}]]], "name": "conv2/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "conv2/3x3", "filters": 192, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2/3x3_reduce", 0, 0, {}]]], "name": "conv2/3x3"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "pool2/3x3_s2", "strides": [2, 2]}, "inbound_nodes": [[["conv2/3x3", 0, 0, {}]]], "name": "pool2/3x3_s2"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3a/3x3_reduce", "filters": 96, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0, {}]]], "name": "inception_3a/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3a/5x5_reduce", "filters": 16, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0, {}]]], "name": "inception_3a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "inception_3a/pool", "strides": [1, 1]}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0, {}]]], "name": "inception_3a/pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3a/1x1", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0, {}]]], "name": "inception_3a/1x1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3a/3x3", "filters": 128, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/3x3_reduce", 0, 0, {}]]], "name": "inception_3a/3x3"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [5, 5], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3a/5x5", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/5x5_reduce", 0, 0, {}]]], "name": "inception_3a/5x5"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3a/pool_proj", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/pool", 0, 0, {}]]], "name": "inception_3a/pool_proj"}, {"class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "name": "inception_3a/output"}, "inbound_nodes": [[["inception_3a/1x1", 0, 0, {}], ["inception_3a/3x3", 0, 0, {}], ["inception_3a/5x5", 0, 0, {}], ["inception_3a/pool_proj", 0, 0, {}]]], "name": "inception_3a/output"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3b/3x3_reduce", "filters": 128, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/output", 0, 0, {}]]], "name": "inception_3b/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3b/5x5_reduce", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/output", 0, 0, {}]]], "name": "inception_3b/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "inception_3b/pool", "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/output", 0, 0, {}]]], "name": "inception_3b/pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3b/1x1", "filters": 128, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3a/output", 0, 0, {}]]], "name": "inception_3b/1x1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3b/3x3", "filters": 192, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3b/3x3_reduce", 0, 0, {}]]], "name": "inception_3b/3x3"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [5, 5], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3b/5x5", "filters": 96, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3b/5x5_reduce", 0, 0, {}]]], "name": "inception_3b/5x5"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_3b/pool_proj", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_3b/pool", 0, 0, {}]]], "name": "inception_3b/pool_proj"}, {"class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "name": "inception_3b/output"}, "inbound_nodes": [[["inception_3b/1x1", 0, 0, {}], ["inception_3b/3x3", 0, 0, {}], ["inception_3b/5x5", 0, 0, {}], ["inception_3b/pool_proj", 0, 0, {}]]], "name": "inception_3b/output"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "pool3/3x3_s2", "strides": [2, 2]}, "inbound_nodes": [[["inception_3b/output", 0, 0, {}]]], "name": "pool3/3x3_s2"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4a/3x3_reduce", "filters": 96, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0, {}]]], "name": "inception_4a/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4a/5x5_reduce", "filters": 16, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0, {}]]], "name": "inception_4a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "inception_4a/pool", "strides": [1, 1]}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0, {}]]], "name": "inception_4a/pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4a/1x1", "filters": 192, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0, {}]]], "name": "inception_4a/1x1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4a/3x3", "filters": 208, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/3x3_reduce", 0, 0, {}]]], "name": "inception_4a/3x3"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [5, 5], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4a/5x5", "filters": 48, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/5x5_reduce", 0, 0, {}]]], "name": "inception_4a/5x5"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4a/pool_proj", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/pool", 0, 0, {}]]], "name": "inception_4a/pool_proj"}, {"class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "name": "inception_4a/output"}, "inbound_nodes": [[["inception_4a/1x1", 0, 0, {}], ["inception_4a/3x3", 0, 0, {}], ["inception_4a/5x5", 0, 0, {}], ["inception_4a/pool_proj", 0, 0, {}]]], "name": "inception_4a/output"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4b/3x3_reduce", "filters": 112, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/output", 0, 0, {}]]], "name": "inception_4b/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4b/5x5_reduce", "filters": 24, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/output", 0, 0, {}]]], "name": "inception_4b/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "inception_4b/pool", "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/output", 0, 0, {}]]], "name": "inception_4b/pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4b/1x1", "filters": 160, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4a/output", 0, 0, {}]]], "name": "inception_4b/1x1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4b/3x3", "filters": 224, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4b/3x3_reduce", 0, 0, {}]]], "name": "inception_4b/3x3"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [5, 5], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4b/5x5", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4b/5x5_reduce", 0, 0, {}]]], "name": "inception_4b/5x5"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4b/pool_proj", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4b/pool", 0, 0, {}]]], "name": "inception_4b/pool_proj"}, {"class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "name": "inception_4b_output"}, "inbound_nodes": [[["inception_4b/1x1", 0, 0, {}], ["inception_4b/3x3", 0, 0, {}], ["inception_4b/5x5", 0, 0, {}], ["inception_4b/pool_proj", 0, 0, {}]]], "name": "inception_4b_output"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4c/3x3_reduce", "filters": 128, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4b_output", 0, 0, {}]]], "name": "inception_4c/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4c/5x5_reduce", "filters": 24, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4b_output", 0, 0, {}]]], "name": "inception_4c/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "inception_4c/pool", "strides": [1, 1]}, "inbound_nodes": [[["inception_4b_output", 0, 0, {}]]], "name": "inception_4c/pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4c/1x1", "filters": 128, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4b_output", 0, 0, {}]]], "name": "inception_4c/1x1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4c/3x3", "filters": 256, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/3x3_reduce", 0, 0, {}]]], "name": "inception_4c/3x3"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [5, 5], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4c/5x5", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/5x5_reduce", 0, 0, {}]]], "name": "inception_4c/5x5"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4c/pool_proj", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/pool", 0, 0, {}]]], "name": "inception_4c/pool_proj"}, {"class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "name": "inception_4c/output"}, "inbound_nodes": [[["inception_4c/1x1", 0, 0, {}], ["inception_4c/3x3", 0, 0, {}], ["inception_4c/5x5", 0, 0, {}], ["inception_4c/pool_proj", 0, 0, {}]]], "name": "inception_4c/output"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4d/3x3_reduce", "filters": 144, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/output", 0, 0, {}]]], "name": "inception_4d/3x3_reduce"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4d/5x5_reduce", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/output", 0, 0, {}]]], "name": "inception_4d/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "name": "inception_4d/pool", "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/output", 0, 0, {}]]], "name": "inception_4d/pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4d/1x1", "filters": 112, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4c/output", 0, 0, {}]]], "name": "inception_4d/1x1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4d/3x3", "filters": 288, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4d/3x3_reduce", 0, 0, {}]]], "name": "inception_4d/3x3"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [5, 5], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4d/5x5", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4d/5x5_reduce", 0, 0, {}]]], "name": "inception_4d/5x5"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "inception_4d/pool_proj", "filters": 64, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["inception_4d/pool", 0, 0, {}]]], "name": "inception_4d/pool_proj"}, {"class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "name": "inception_4d/output"}, "inbound_nodes": [[["inception_4d/1x1", 0, 0, {}], ["inception_4d/3x3", 0, 0, {}], ["inception_4d/5x5", 0, 0, {}], ["inception_4d/pool_proj", 0, 0, {}]]], "name": "inception_4d/output"}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [5, 5], "name": "loss2/ave_pool", "strides": [3, 3]}, "inbound_nodes": [[["inception_4d/output", 0, 0, {}]]], "name": "loss2/ave_pool"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "name": "loss2/conv", "filters": 128, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["loss2/ave_pool", 0, 0, {}]]], "name": "loss2/conv"}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00019999999494757503, "l1": 0.0}}, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 512, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.7}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "softmax", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 8, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.5"}